---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
FileSaveDialog Properties
FileSaveDialog Class See Also Send Feedback
---

The FileSaveDialog type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | DefaultFilterEntry | The default entry (from the filter) to be selected in the dialog.  (Inherited from FileDialog.) |
|  | Filter | The filter string representing a collection of extensions allowed by the dialog.  (Inherited from FileDialog.) |
|  | InitialFileName | The initial file name to be shown for this save operation. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from FileDialog.) |
|  | Title | The title to show on the dialog.  (Inherited from FileDialog.) |

# See Also

FileSaveDialog Class

Autodesk.Revit.UI Namespace